// 보그 PJ 링크 시스템 JS - linksys.js ///////

$(() => { ////////// jQB ///////////////////////

    /************************************** 
        로그인, 회원가입, 갤러리 아이콘 넣기
    **************************************/
    // 대상: .sns a:last-child (마지막 카스링크)
    // 변경: 대상요소 앞에 a요소 코드를 삽입한다!
    // 메서드: before(요소) -> 선택요소 앞에 형제요소 삽입
    // -> 참고) after(요소) -> 선택요소 뒤에 형제요소 삽입
    // 선택자 :last는 제이쿼리 전용임!
    

    ///// sns 파트 a요소들에 툴팁넣기 ////////
    

    // 선택메서드 비교
    // find(요소) - 자손선택
    // children(요소) - 직계자식선택

    /************************************ 
        SNS 메뉴 파트 링크 셋팅하기
    ************************************/
    // 대상: .sns a
    

    /************************************ 
            메인로고 링크 셋팅하기
    ************************************/
    
    /************************************ 
        GNB 메뉴 파트 링크 셋팅하기
    ************************************/
    // 대상: .gnb a
    



}); ////////////// jQB ///////////////////////